import random
def z1():
    a=["1", "4", "6", "13", "21"]
    b = input('введите число ')
    if b in a:
        print('ваше число: ', b, ', исходный список: ', *a, ', вы угадали!')
    else:
        print('ваше число: ', b, ', исходный список: ', *a, ', вы не угадали')

def z2():
    a=["1", "4", "6", "6", "6", "13", "21", "21"]
    for i in a:
        if a.count(i) >= 2:
            print(i)

def z3():
    a=("пн","вт","ср","чт","пт","сб","вс")
    b = int(input('сколько нужно выходных? '))
    for i in a:
        print('выходные: ', *a[-b:])
        print('рабочие: ', *a[:-b])
        break

def z4():
    a=["Смирнова","Иванов","Кузнецов","Соколов","Попов","Лебедева","Иванов","Новиков","Морозова","Петров"]
    b=["Волков","Соловьёв","Васильев","Зайцева","Павлова","Семёнов","Голубева","Виноградов","Иванов","Воробьёва"]
    c = tuple(random.sample(a, 5) + random.sample(b, 5))
    print("группа 1: ", a)
    print("группа 2: ", b)
    print("спорт команда:", c)
    print("длина спортивной команды:", len(c))
    sort_c = tuple(sorted(c))
    print("отсортированная спорт команда:", sort_c)
    ic = c.count('Иванов')
    if ic > 0:
        print("Иванов есть")
    else:
        print("Иванова нет")
    print("количество Ивановых: ", ic)
